---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ParameterSet Properties
ParameterSet Class See Also Send Feedback
---

The ParameterSet type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
|  | Size | Returns the number of parameters that are in the set. |

# See Also

ParameterSet Class

Autodesk.Revit.DB Namespace